; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 181067 2 3 4 8 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	Star5 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(have_image Phenomenon8 thermograph1)
	(have_image Star9 spectrograph0)
	(have_image Star10 thermograph1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (turn_to satellite1 star9 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star9)
   goals met: 0 of 3
4. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 0 of 3
5. (turn_to satellite0 phenomenon8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon8)
   goals met: 0 of 3
6. (turn_to satellite1 groundstation7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation7)
   goals met: 0 of 3
7. (calibrate satellite1 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 0 of 3
8. (turn_to satellite0 star10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star10)
   goals met: 0 of 3
9. (turn_to satellite1 star9 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 star9)
   goals met: 0 of 3
10. (turn_to satellite0 phenomenon8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon8)
   goals met: 0 of 3
11. (take_image satellite1 star9 instrument2 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 1 of 3
12. (turn_to satellite0 groundstation1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 3
13. (turn_to satellite1 star10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star10)
   goals met: 1 of 3
14. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 3
15. (take_image satellite1 star10 instrument2 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 2 of 3
16. (turn_to satellite0 phenomenon8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 3
17. (take_image satellite0 phenomenon8 instrument0 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 3 of 3
